<a href="https://colab.research.google.com/github/nirav3/data690_nirav/blob/main/assignments/assignment_4/in_class_practice_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


# Assignment #4    
  * Professor: Dr. Jay Wang    
  * Student: Nirav Pancholi    
  * Date: 09/23/2021

## Pandas Dataframe

In [1]:
import pandas as pd

In [7]:
df = pd.read_csv("/content/census_costs.txt", sep="\t", skiprows=1)

df.head(5)

  Census Year Total Population Census Cost Average Cost Per Person
0        1790        3,929,214     $44,377              1.13 cents
1        1800        5,308,483     $66,109              1.24 cents
2        1810        7,239,881    $178,445              2.46 cents
3        1820        9,633,822    $208,526              2.16 cents
4        1830       12,866,020    $378,545              2.94 cents

In [8]:
df.tail(5)

   Census Year Total Population     Census Cost Average Cost Per Person
18        1970      203,302,031    $247,653,000                   $1.22
19        1980      226,542,199  $1,078,488,000                   $4.76
20        1990      248,718,301  $2,492,830,000                  $10.02
21        2000      281,421,906    $4.5 Billion                  $15.99
22       2010*      308,745,538     $13 Billion                  $42.11

In [9]:
df.sample(5)

   Census Year Total Population   Census Cost Average Cost Per Person
3         1820        9,633,822      $208,526              2.16 cents
1         1800        5,308,483       $66,109              1.24 cents
18        1970      203,302,031  $247,653,000                   $1.22
0         1790        3,929,214       $44,377              1.13 cents
14        1930      122,775,046   $40,156,000             32.71 cents

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Census Year              23 non-null     object
 1   Total Population         23 non-null     object
 2   Census Cost              23 non-null     object
 3   Average Cost Per Person  23 non-null     object
dtypes: object(4)
memory usage: 864.0+ bytes

In [15]:
df.describe()

       Census Year Total Population   Census Cost Average Cost Per Person
count           23               23            23                      23
unique          23               23            23                      23
top           1890       62,979,766  $247,653,000             71.34 cents
freq             1                1             1                       1

In [18]:
df.dtypes

Census Year                object
Total Population           object
Census Cost                object
Average Cost Per Person    object
dtype: object

In [22]:
## NOTE: 
##    df["Total Population"] returns a series (list like structure)
##    df[["Total Population"]] returns a new data frame with one column.

population_list = df["Total Population"].tolist()
population_list

['3,929,214',
 '5,308,483',
 '7,239,881',
 '9,633,822',
 '12,866,020',
 '17,069,458',
 '23,191,876',
 '31,443,321',
 '38,558,371',
 '50,155,783',
 '62,979,766',
 '76,303,387',
 '91,972,266',
 '105,710,620',
 '122,775,046',
 '131,669,275',
 '151,325,798',
 '179,323,175',
 '203,302,031',
 '226,542,199',
 '248,718,301',
 '281,421,906',
 '308,745,538']

In [30]:
## function: converts string with "," to int
def convertToInt(a_string):
    return int(a_string.replace(",", ""))

In [27]:
a_int = convertToInt("12343,445,656,")
a_int

12343445656

In [28]:
df["total_pop"] = df["Total Population"].apply(convertToInt)

In [29]:
df.head(10)

  Census Year Total Population Census Cost Average Cost Per Person  total_pop
0        1790        3,929,214     $44,377              1.13 cents    3929214
1        1800        5,308,483     $66,109              1.24 cents    5308483
2        1810        7,239,881    $178,445              2.46 cents    7239881
3        1820        9,633,822    $208,526              2.16 cents    9633822
4        1830       12,866,020    $378,545              2.94 cents   12866020
5        1840       17,069,458    $833,371              4.88 cents   17069458
6        1850       23,191,876  $1,423,351              6.14 cents   23191876
7        1860       31,443,321  $1,969,377              6.26 cents   31443321
8        1870       38,558,371  $3,421,198              8.87 cents   38558371
9        1880       50,155,783  $5,790,678             11.54 cents   50155783

In [31]:
df.describe()

          total_pop
count  2.300000e+01
mean   1.039211e+08
std    9.622629e+07
min    3.929214e+06
25%    2.013067e+07
50%    7.630339e+07
75%    1.653245e+08
max    3.087455e+08